# Import libraries

In [2]:
import pandas as pd

### Interesting raw data information
* The source files do not contain a consolidated combination of inputs and outputs - the outputs are found in a different file (credit_record.csv) to the inputs file (application_record)
* Best approach is to load both in and see what we are dealing with

In [3]:
app_raw = pd.read_csv('application_record.csv')
credit_raw = pd.read_csv('credit_record.csv')

In [4]:
app_raw.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [5]:
credit_raw.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

#### Note
* Thankfully both the input and output files contain a common "# ID" column. Joining on this column would make the most sense.
* Empty values will not be of much use here, for that reason an inner join will serve us best.

In [6]:
# Merge the two DataFrames on the 'ID' column
merged_df = pd.merge(app_raw, credit_raw, on='ID', how='inner')
merged_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,MONTHS_BALANCE,STATUS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,0,C
1,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,-1,C
2,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,-2,C
3,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,-3,C
4,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0,-4,C

In [7]:
print(len(app_raw), len(credit_raw), len(merged_df))

438557 1048575 777715

### Input/ Output Imbalances
* Comparing the raw counts of each file shows imbalances:
    * Inputs: ~439k rows
    * Outputs: ~1M rows
* However, when combined on the inner join, the result is approximately **780k rows**.
* This means there has to be duplicates. Further investigation required.

# Investigating Outputs
* Starting with output file because it has fewer columns

In [10]:
credit_raw.describe(include='all')

                  ID  MONTHS_BALANCE   STATUS
count   1.048575e+06    1.048575e+06  1048575
unique           NaN             NaN        8
top              NaN             NaN        C
freq             NaN             NaN   442031
mean    5.068286e+06   -1.913700e+01      NaN
std     4.615058e+04    1.402350e+01      NaN
min     5.001711e+06   -6.000000e+01      NaN
25%     5.023644e+06   -2.900000e+01      NaN
50%     5.062104e+06   -1.700000e+01      NaN
75%     5.113856e+06   -7.000000e+00      NaN
max     5.150487e+06    0.000000e+00      NaN

In [9]:
credit_raw

              ID  MONTHS_BALANCE STATUS
0        5001711               0      X
1        5001711              -1      0
2        5001711              -2      0
3        5001711              -3      0
4        5001712               0      C
...          ...             ...    ...
1048570  5150487             -25      C
1048571  5150487             -26      C
1048572  5150487             -27      C
1048573  5150487             -28      C
1048574  5150487             -29      C

[1048575 rows x 3 columns]